tap "homebrew/bundle"
tap "steipete/tap"
brew "cloudflared"
brew "eza"
brew "fish"
brew "gh"
brew "git"
brew "neovim"
brew "peco"
brew "pyenv"
brew "ripgrep"
brew "tmux"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
cask "claude-code"
vscode "ankitcode.firefly"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "circleci.circleci"
vscode "continue.continue"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "mtxr.sqltools"
vscode "nimsaem.nimvscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "vue.volar"
vscode "ziglang.vscode-zig"
