tap "homebrew/bundle"
# Modern, maintained replacement for ls
brew "eza"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Simplistic interactive filtering tool
brew "peco"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
vscode "adrianwilczynski.alpine-js-intellisense"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "angulardoc.angulardoc-vscode"
vscode "ankitcode.firefly"
vscode "antfu.file-nesting"
vscode "apvarun.celestial"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "circleci.circleci"
vscode "citrixdeveloper.citrixdeveloper-vscode"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "discountry.react-redux-react-router-snippets"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drkryz.drkryz-theme"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.code-runner"
vscode "gaplo917.gapstylevs"
vscode "genuitecllc.codetogether"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hediet.debug-visualizer"
vscode "honnamkuan.golang-snippets"
vscode "janisdd.vscode-edit-csv"
vscode "jasonn-porch.gitlab-mr"
vscode "johnpapa.angular2"
vscode "junstyle.php-cs-fixer"
vscode "kevinrose.vsc-python-indent"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "marqu3s.aurora-x"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikebovenlander.formate"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naco-siren.gradle-language"
vscode "paulmolluzzo.convert-css-in-js"
vscode "payara.payara-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "postman.postman-for-vscode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "skyapps.fish-vscode"
vscode "splunk.splunk"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "tsandall.opa"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "zhucy.project-tree"
vscode "ziglang.vscode-zig"
