tap "anomalyco/tap"
tap "homebrew/bundle"
brew "bat"
brew "cloudflared"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "git-lfs"
brew "neovim"
brew "peco"
brew "postgresql@18", restart_service: :changed, link: true
brew "pyenv"
brew "ripgrep"
brew "signal-cli"
brew "tmux"
brew "anomalyco/tap/opencode"
cask "codex"
vscode "ankitcode.firefly"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "charliermarsh.ruff"
vscode "circleci.circleci"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "mtxr.sqltools"
vscode "nimsaem.nimvscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "vue.volar"
vscode "ziglang.vscode-zig"
